# How to calculate summary statistics?

Follow along with this [article](https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/06_calculate_statistics.html). The data set from the article has been included in the repository already, no need to download separately. This notebook will also contain some supplemental information to help you better understand basic summary statistics.

First thing we want to do is to import the pandas library.

In [1]:
# import the pandas library and use the alias 'pd'
import pandas as pd

We are going to be working with the titanic dataset found [here.](https://github.com/pandas-dev/pandas/blob/master/doc/data/titanic.csv) It is in csv format and consists fo the following data columns:


- PassengerId: Id of every passenger.
- Survived: Value of 0 for not survived and 1 for survived.
- Pclass: There are 3 classes: Class 1, Class 2 and Class 3.
- Name: Name of passenger.
- Sex: Gender of passenger.
- Age: Age of passenger.
- SibSp: Number of siblings / spouses on the Titanic
- Parch: Number of parents / children on the Titanic
- Ticket: Ticket number of passenger.
- Fare: Indicating the fare.
- Cabin: The cabin of passenger.
- Embarked: Port of Embarkation ( C = Cherbourg, Q = Queenstown, S = Southampton)

Let's load the data into a data frame and see what the data looks like. Since your csv file is in a folder named data, the path syntex is: data/your_data_set_name.csv to read your data into a data frame.

In [2]:
#read titantic data set into a data frame
titanic=pd.read_csv("~/Dropbox/LaunchCode Data Analysis/Git Repos/EDApt2Exercises/Data/titanic.csv")

#although we listed the column names above, write the code to return the name of all of your columns in the dataset
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [3]:
# print the first 5 rows from the dataframe
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

What are some of your observations from looking at the data so far? Questions you would like to explore?

For example: I noticed that Survived is an int instead of Yes or No, not sure if I'll need to address that while data cleaning. I'm curious if the amount you paid for your ticket(Fare) impacted your survival rate?

Also embarked could be recoded to 0/1. 
<br><br><br><br><br>

In [4]:
#.info() returns: 
#name of the column, Non-null Count meaning how many non-null values their are in that column and Dtype
#int64 means int value, float64 means float value, object means string value.
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

By default statistical anaysis is run on numerical values.  

Looking at the data above what do you notice about Age? Cabin? Hint: It would appear we are missing some data. How might these observations influence the questions asked?

We are missing a lot of age data. That may not be reliable or we should see if the missing data is random (perhaps the info missing is impacted by passenger class. If it is missing at random we can use imputation. There is even more missing data on cabin and this is not an integer variable we can use imputation on. We will likley not be able to use the cabin variable. 

<br><br>

Any other observations?
<br><br><br>

## Aggregating statistics

### Calculating Mean, Median, Mode

#### Mean: is the sum of the values divided by the number of values.

In [5]:
#What is the mean age of the Titanic passengers?
titanic['Age'].mean()

29.69911764705882

We can also get the mean for all columns.

In [6]:
#mean for all columns
titanic.mean(numeric_only=True)

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

#### Median: Is the middle value when all the numbers are put in order, dividing the sample into two halves.  

Example: (23, 46, 55, 78, 99)<br> 
The Median of the above example is 55.

In [7]:
# What is the median age and ticket fare price of the Titanic passengers?
titanic[['Age', 'Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

#### Mode: The most frequent value(s) in a sample

In [8]:
# What is the mode age and fare for the titanic dateset?
titanic[['Age', 'Fare']].mode()

    Age  Fare
0  24.0  8.05

Note the difference between Mean, Medium and Mode.  Why is this important? Can you think of times you would what to use one over the others?

When you are working with heavily skewed datav(e.g., there are outliers of maybe several folks who are much older), then you may prefer to use the median if you would like a sense of what the average age is. In the example, the mean would be higher, making the data look like most passangers were slighly older when really a few outlying older passangers were driving up the mean. The mode may be important in cases in which there is minimal variabilty on the data, perhaps when the data is likley to be more discreate and a fractioned mean does not have as much meaning (e.g., You are looking at the average age of a kindergarten class. Most students are 6 years old, but a couple at 7 or 5. The mode of 6 better represent a measure of cental tendency). If there are not any annomilies, outliers, or contextual considerations (that is the data mostly lies on the average curve), and mean is likley you most logical and specific option to represent an average. 

<br><br><br><br><br>

We can use the .describe() funciton to display some basic statistics for all numeric columns:

In [9]:
# Summary statistics for all columns in a dataset
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
# Summary statistics for just the Age and Fare columns
titanic[['Age', 'Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

Notice that medium and mode are not included in .describe()

Instead of the predefined statistics, specific combinations of aggregating statistics for given columns can be defined using the [DataFrame.agg() method:](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg)

In [11]:
#use .agg
titanic[['Age', 'Fare']].agg({
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    })

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.389108         NaN
mean          NaN   32.204208

## Aggregating statistics grouped by category

Calculating a given statistic (e.g. mean age) for each category in a column (e.g. male/female in the Sex column) is a common pattern. The groupby method is used to support this type of operations.

In [12]:
# What is the average age for male versus female Titanic passengers?
titanic[['Age', 'Sex']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645

In [13]:
# What is the survival of men verses female Titanic Passengers? 
titanic[['Survived', 'Sex']].groupby('Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

In [14]:
# Try some other combinations, what do you think about this method?
titanic[['Survived', 'Age']].groupby('Survived').mean()

                Age
Survived
0         30.626179
1         28.343690

In the previous examples, we explicitly selected the 2 columns first. If not, the mean method is applied to each column containing numerical columns:

In [15]:
#use .groupby Sex and .mean
titanic.groupby('Sex').mean(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

It does not make much sense to get the average value of the Pclass. if we are only interested in the average age for each gender, the selection of columns (rectangular brackets [] as usual) is supported on the grouped data as well:

In [16]:
#use .goupby Sex just for Age 
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [17]:
# What is the mean ticket fare price for each of the sex and cabin class combinations?
titanic.groupby(['Sex','Pclass'])['Fare'].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [18]:
# Try some other combinations, what do you think about this method?
titanic.groupby(['Pclass', 'Sex', 'Survived'])['Age', 'Survived'].mean()

/var/folders/nc/sfbwykc541d4ktbn0q7gz6080000gp/T/ipykernel_94767/1378111505.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  titanic.groupby(['Pclass', 'Sex', 'Survived'])['Age', 'Survived'].mean()

                              Age  Survived
Pclass Sex    Survived
1      female 0         25.666667       0.0
              1         34.939024       1.0
       male   0         44.581967       0.0
              1         36.248000       1.0
2      female 0         36.000000       0.0
              1         28.080882       1.0
       male   0         33.369048       0.0
              1         16.022000       1.0
3      female 0         23.818182       0.0
              1         19.329787       1.0
       male   0         27.255814       0.0
              1         22.274211       1.0

## Count number of records by category

The value_counts() method counts the number of records for each category in a column.

In [19]:
# What is the number of passengers in each of the cabin classes?
titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

The function is a shortcut, as it is actually a groupby operation in combination with counting of the number of records within each group:

In [20]:
#Count the number of passengers by cabin classes using groupby
titanic.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

In [21]:
# Using the value_counts method what else could you count?
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64